import RegistrationLayout from './RegistrationLayout'
import styles from './StepsStyles.module.scss'
import Link from 'next/link'


const Step3 = () => {
  
  return ( 
    <RegistrationLayout width="900px">
      <div className={styles.tariff}>

        <div className={styles.tariff__header}>
          <h2 className={styles.tariff__title}>
            Используйте
            <span className={styles.tariff__pro}>
              <svg xmlns="http://www.w3.org/2000/svg" width="50" height="25" viewBox="0 0 50 25" fill="none">
                <rect width="50" height="25" rx="5.35714" fill="url(#paint0_linear_403_41167)"/>
                <path d="M14.9461 13.9975H12.177V12.3216H14.9461C15.374 12.3216 15.7223 12.2548 15.991 12.1211C16.2597 11.9826 16.4563 11.7917 16.5807 11.5482C16.7051 11.3047 16.7673 11.0301 16.7673 10.7245C16.7673 10.4142 16.7051 10.1253 16.5807 9.85794C16.4563 9.59056 16.2597 9.3757 15.991 9.21336C15.7223 9.05102 15.374 8.96985 14.9461 8.96985H12.9533V17.7146H10.7141V7.28679H14.9461C15.797 7.28679 16.5259 7.43481 17.133 7.73084C17.745 8.02209 18.2127 8.42554 18.5362 8.94121C18.8596 9.45687 19.0213 10.0465 19.0213 10.7102C19.0213 11.3834 18.8596 11.9659 18.5362 12.4577C18.2127 12.9495 17.745 13.3291 17.133 13.5965C16.5259 13.8639 15.797 13.9975 14.9461 13.9975Z" fill="#F5F5F5"/>
                <path d="M20.5663 7.28679H24.6192C25.4501 7.28679 26.1642 7.40616 26.7613 7.64489C27.3634 7.88362 27.8261 8.23695 28.1495 8.70486C28.473 9.17278 28.6347 9.74812 28.6347 10.4309C28.6347 10.9895 28.5352 11.4694 28.3361 11.8704C28.1421 12.2667 27.8659 12.5986 27.5077 12.866C27.1544 13.1286 26.7389 13.3386 26.2612 13.4962L25.5521 13.8543H22.0292L22.0143 12.1784H24.6341C25.0272 12.1784 25.3531 12.1116 25.6119 11.9779C25.8706 11.8442 26.0647 11.658 26.194 11.4192C26.3284 11.1805 26.3956 10.9036 26.3956 10.5885C26.3956 10.2542 26.3309 9.96537 26.2015 9.72186C26.0721 9.47835 25.8756 9.29214 25.6119 9.16323C25.3481 9.03431 25.0172 8.96985 24.6192 8.96985H22.8055V17.7146H20.5663V7.28679ZM26.6419 17.7146L24.1639 13.0665L26.5299 13.0522L29.0377 17.6143V17.7146H26.6419Z" fill="#F5F5F5"/>
                <path d="M39.2855 12.2572V12.7514C39.2855 13.544 39.1736 14.2554 38.9497 14.8856C38.7258 15.5159 38.4098 16.053 38.0018 16.4971C37.5937 16.9363 37.1061 17.2729 36.5389 17.5069C35.9766 17.7409 35.3521 17.8578 34.6654 17.8578C33.9838 17.8578 33.3593 17.7409 32.792 17.5069C32.2298 17.2729 31.7421 16.9363 31.3291 16.4971C30.9161 16.053 30.5952 15.5159 30.3663 14.8856C30.1424 14.2554 30.0304 13.544 30.0304 12.7514V12.2572C30.0304 11.4598 30.1424 10.7484 30.3663 10.1229C30.5902 9.49268 30.9062 8.95553 31.3142 8.51149C31.7272 8.06745 32.2148 7.72845 32.7771 7.49449C33.3444 7.26053 33.9688 7.14355 34.6505 7.14355C35.3372 7.14355 35.9617 7.26053 36.5239 7.49449C37.0912 7.72845 37.5788 8.06745 37.9868 8.51149C38.3998 8.95553 38.7183 9.49268 38.9422 10.1229C39.1711 10.7484 39.2855 11.4598 39.2855 12.2572ZM37.024 12.7514V12.2429C37.024 11.689 36.9718 11.202 36.8673 10.7818C36.7628 10.3617 36.6085 10.0083 36.4045 9.72186C36.2005 9.43538 35.9517 9.22052 35.6581 9.07728C35.3646 8.92927 35.0287 8.85526 34.6505 8.85526C34.2724 8.85526 33.9365 8.92927 33.6429 9.07728C33.3543 9.22052 33.108 9.43538 32.904 9.72186C32.705 10.0083 32.5532 10.3617 32.4487 10.7818C32.3442 11.202 32.292 11.689 32.292 12.2429V12.7514C32.292 13.3004 32.3442 13.7875 32.4487 14.2124C32.5532 14.6326 32.7074 14.9883 32.9115 15.2795C33.1155 15.566 33.3643 15.7833 33.6578 15.9313C33.9514 16.0793 34.2873 16.1533 34.6654 16.1533C35.0436 16.1533 35.3795 16.0793 35.6731 15.9313C35.9666 15.7833 36.2129 15.566 36.412 15.2795C36.611 14.9883 36.7628 14.6326 36.8673 14.2124C36.9718 13.7875 37.024 13.3004 37.024 12.7514Z" fill="#F5F5F5"/>
                <defs>
                  <linearGradient id="paint0_linear_403_41167" x1="0" y1="0" x2="50.7562" y2="23.3568" gradientUnits="userSpaceOnUse">
                    <stop stopColor="#FF961B"/>
                    <stop offset="1" stopColor="#DA7600"/>
                  </linearGradient>
                </defs>
              </svg>
            </span> 
            статус для <br />для продуктивной работы своего бизнеса
          </h2>
          <div className={styles.tariff__tz}>*ТЗ - Техническое задание</div>
        </div>
          <div className={styles.tariff__cards}>
            <div className={styles.tariff__card}>
              <div className={[styles.tariff__body, styles.tariff__body_pro].join(' ')}>
                <div className={[styles.tariff__cardTitle, styles.tariff__cardTitle_orange].join(' ')}>Подписка PRO</div>
                <ul className={styles.tariff__list}>
                  <li className={styles.tariff__item}>- Конструктор ТЗ* без ограничений</li>
                  <li className={styles.tariff__item}>- Не ограниченное количество ТЗ*</li>
                  <li className={styles.tariff__item}>- Отправляйте ТЗ* всем подходящим исполнителям</li>
                  <li className={styles.tariff__item}>- Получите доступ к контактам исполнителей </li>
                  <li className={styles.tariff__item}>- Доступны все алгоритмы платформы для работы</li>
                </ul>
                <div className={styles.tariff__link}>
                  <Link className={[styles.tariff__button, styles.tariff__button_pro].join(' ')} href="/nolayout">Выбрать</Link>
                  <p className={styles.tariff__money}>от 200 руб</p>
                </div>
              </div>
            </div>

            <div className={styles.tariff__card}>
              <div className={styles.tariff__body}>
                <div className={styles.tariff__cardTitle}>Бесплатно с ограничениями</div>
                <ul className={styles.tariff__list}>
                  <li className={styles.tariff__item}>- 5 бесплатных ТЗ* в месяц</li>
                  <li className={styles.tariff__item}>- Ограничение в конструкторе ТЗ*</li>
                  <li className={styles.tariff__item}>- Отправить ТЗ можно максимум трем исполнителям</li>
                  <li className={styles.tariff__item}>- Недоступны контакты исполнителей без их отклика</li>
                  <li className={styles.tariff__item}>- Доступны не все алгоритмы платформы</li>
                </ul>
                <div className={styles.tariff__link}>
                  <Link className={styles.tariff__button} href="/profile/home">Выбрать</Link>
                  <p className={styles.tariff__money}>Бесплатно</p>
                </div>
              </div>
            </div>
          </div>
      </div>
    </RegistrationLayout>
   );
}
export default Step3;


